In [1]:
import numpy as np
import pandas as pd

## 4.1 판다스 패키지의 소개

#### 4.1.1

In [11]:
s1 = pd.Series([10,20,30],
              index=['사과', '딸기', '바나나'])

s2 = pd.Series([40,50,60],
                index=['사과', '딸기', '바나나']) 

s3 = s1 + s2
s3

사과     50
딸기     70
바나나    90
dtype: int64

#### 4.1.2

In [14]:
data = {
    "반": [1,2,3,4,5],
    "과목": ['국어', '수학', '영어', '과학', '역사'],
    "성적1": [65.7, 68.8, 98.9, 86.5, 78.5],
    "성적2": [57.5, 65.8, 75.3, 54.2, 99.2],
    "성적3": [35.8, 45.7, 77.6, 40.8, 98.4]
}
index = ['짱구', '훈이', '철수', '유리', '맹구']
columns = ['반', '과목', '성적1', '성적2', '성적3']

df = pd.DataFrame(data, index=index, columns=columns)
df

    반  과목   성적1   성적2   성적3
짱구  1  국어  65.7  57.5  35.8
훈이  2  수학  68.8  65.8  45.7
철수  3  영어  98.9  75.3  77.6
유리  4  과학  86.5  54.2  40.8
맹구  5  역사  78.5  99.2  98.4

### 4.1.3

In [16]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [17]:
# 1)
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [23]:
# 2)
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [31]:
# 3)
df['평균'] = round(((df['국어'] + df['영어'] + df['수학']) / 3), 2)
df

# df['평균'] = np.round(df.mean(axis=1), 2)

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [33]:
# 4)
df.loc['방자', '영어'] = 80
df

df['평균'] = round(((df['국어'] + df['영어'] + df['수학']) / 3), 2)
df

# del df['평균']
# df['영어'][3] = 80

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [40]:
# 5)
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [48]:
# 6)
df.iloc[2]

# df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

## 4.3 데이터프레임 고급 인덱싱

### 4.3.1

In [54]:
data = {
    "a": [1, 2, 3, 4, 5],
    "b": [11, 22, 33, 44, 55],
    "c": [10, 20, 30, 40, 50],
    "d": [21, 22, 23, 24, 24],
    "e": [100, 200, 300, 400, 500]
}

columns = ["a", "b", "c", "d", "e"]
index = ["사과", "딸기", "수박", "귤", "포도"]
df = pd.DataFrame(data, columns = columns, index = index)
df

    a   b   c   d    e
사과  1  11  10  21  100
딸기  2  22  20  22  200
수박  3  33  30  23  300
귤   4  44  40  24  400
포도  5  55  50  24  500

## 4.4 데이터프레임의 데이터 조작

### 4.4.1

In [55]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [56]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 4.4.2

In [71]:
titanic['sex'].value_counts().sort_values()

male      577
female    314
Name: sex, dtype: int64

### 4.4.3

In [81]:
titanic.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

### 4.4.4

In [ ]:
titanic = titanic[['survived', 'pclass', 'sex', 'age']]
titanic = sns.load_dataset

## 4.5 데이터프레임 인덱스 조작

### 4.5.1

In [ ]:
df_score1 = {
    "a": [55, 78, 91],
    "b": [65, 34, 78],
    "c": [80, 47, 68],
    "d": [88, 79, 95],
    "e": [82, 97, 69]
}

columns = ["국어", "영어", "수학"]
df_score1 = pd.DataFrame(np.vs)